test32.txt
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 50
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 19.209 ms
initial connection time = 10.995 ms
tps = 104.118295 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 50
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 21.541 ms
initial connection time = 71.437 ms
tps = 92.847838 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 2
number of threads: 1
maximum number of tries: 1
number of transactions per client: 50
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 26.721 ms
initial connection time = 58.858 ms
tps = 74.847890 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 25
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 35.131 ms
initial connection time = 123.943 ms
tps = 113.859814 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 25
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 35.360 ms
initial connection time = 129.770 ms
tps = 113.123708 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 4
number of threads: 1
maximum number of tries: 1
number of transactions per client: 25
number of transactions actually processed: 100/100
number of failed transactions: 0 (0.000%)
latency average = 54.892 ms
initial connection time = 159.159 ms
tps = 72.870045 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 12
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 82.298 ms
initial connection time = 330.332 ms
tps = 97.207807 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 12
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 70.350 ms
initial connection time = 257.987 ms
tps = 113.716725 (without initial connection time)
pgbench (16.1 (Ubuntu 16.1-1.pgdg22.04+1))
transaction type: <builtin: TPC-B (sort of)>
scaling factor: 1
query mode: simple
number of clients: 8
number of threads: 1
maximum number of tries: 1
number of transactions per client: 12
number of transactions actually processed: 96/96
number of failed transactions: 0 (0.000%)
latency average = 92.694 ms
initial connection time = 191.344 ms
tps = 86.305789 (without initial connection time)